# 实习二 数据库约束设计
成员：梁昱桐 吴墨笛 袁梦

In [47]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [48]:
import pymysql
pymysql.install_as_MySQLdb()

In [49]:
%%sql 

mysql://stu2100013081:stu2100013081@162.105.146.37:43306
show databases;
use stu2100013081;
show tables;

4 rows affected.
0 rows affected.
8 rows affected.

[('SC',),
 ('STC',),
 ('STC_trigger',),
 ('TC',),
 ('code_table',),
 ('dept',),
 ('emp',),
 ('tmptable',)]

In [50]:
import pymysql

conn = pymysql.connect(host='162.105.146.37', port=43306, user='stu2100013081', passwd='stu2100013081', db='stu2100013081')
cursor = conn.cursor()

try:
    # 禁用外键约束
    cursor.execute("SET FOREIGN_KEY_CHECKS=0;")

    # 获取所有表的名称
    cursor.execute("SHOW TABLES")
    tables = cursor.fetchall()

    # 遍历所有表，对每一个表执行清空操作
    for table_name in tables:
        sql = f"TRUNCATE TABLE {table_name[0]}"
        cursor.execute(sql)

    # 重新启用外键约束
    cursor.execute("SET FOREIGN_KEY_CHECKS=1;")

    conn.commit()
    print("所有表的数据已清空。")
except Exception as e:
    print(f"错误：{e}")
    conn.rollback()
finally:
    cursor.close()
    conn.close()

所有表的数据已清空。

## 基本约束设计
emp(eno, ename, birtyday, level, position, salary, dno)  
dept( dno, dname, budget, manager )

1. 声明eno和dno是递增序列号形式的主码，长度为4的整型，形式为0001,0002，…  
2. 声明Emp中的dno为参照Dept的外码， Dept的manager为参照Emp的外码 
3. 测试外码定义的三种形式 
4. 限定dname为枚举型（数学学院、计算机学院、智能学院、电子学院、元培学院） 
5. 限定position为枚举型（教师、教务、会计、秘书）  
6. 限定level为1到5，缺省为3，salary为2000~200000

建表并添加约束：

In [51]:
%%sql
-- 删除已存在的表
set foreign_key_checks = 0;
drop table if exists emp;
drop table if exists dept;
set foreign_key_checks = 1;

-- 创建新的表
create table emp (
  eno int(4) zerofill not null auto_increment,
  ename varchar(255),
  birthday date,
  level int check (level >= 1 and level <= 5) default 3,
  position enum('教师', '教务', '会计', '秘书'),
  salary decimal(10,2) check (salary >= 2000 and salary <= 200000),
  dno int(4) zerofill,
  primary key (eno)
);

create table dept (
  dno int(4) zerofill not null auto_increment,
  dname enum('数学学院', '计算机学院', '智能学院', '电子学院', '元培学院'),
  budget decimal(10,2),
  manager int(4) zerofill,
  primary key (dno)
);

-- 添加外码约束
alter table emp add foreign key (dno) references dept(dno);
alter table dept add foreign key (manager) references emp(eno);

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

### 约束条件测试-正例

向dept表插入数据：

In [52]:
%%sql
insert into dept(dname, budget) values('数学学院', 1000000.00);
insert into dept(dname, budget) values('计算机学院', 2000000.00);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

确认插入数据是否正确：

In [53]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, '数学学院', Decimal('1000000.00'), None),
 (2, '计算机学院', Decimal('2000000.00'), None)]

向emp表插入数据：

In [54]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) values('李老师', '1970-01-01', 3, '教师', 5000.00, 0001);
insert into emp(ename, birthday, level, position, salary, dno) values('赵教务', '1980-02-02', 4, '教务', 8000.00, 0002);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

确认插入数据是否正确：

In [55]:
%sql select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, '李老师', datetime.date(1970, 1, 1), 3, '教师', Decimal('5000.00'), 1),
 (2, '赵教务', datetime.date(1980, 2, 2), 4, '教务', Decimal('8000.00'), 2)]

更新dept表，设置经理：

In [56]:
%%sql
update dept set manager=0001 where dno=0001;
update dept set manager=0002 where dno=0002;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[]

确认更新数据是否正确：

In [57]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, '数学学院', Decimal('1000000.00'), 1), (2, '计算机学院', Decimal('2000000.00'), 2)]

### 约束条件测试-反例

测试level和salary的check约束：尝试插入不合法数据

In [58]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) values('测试', '1990-03-03', 6, '教务', 3000.00, 0001); -- level超出范围1-5
insert into emp(ename, birthday, level, position, salary, dno) values('测试', '1990-03-03', 3, '教务', 300000.00, 0001); -- salary超出范围2000-200000

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (3819, "Check constraint 'emp_chk_1' is violated.")
[SQL: insert into emp(ename, birthday, level, position, salary, dno) values('测试', '1990-03-03', 6, '教务', 3000.00, 0001); -- level超出范围1-5]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

测试外键约束：尝试插入不存在的部门编号

In [59]:
%sql insert into emp(ename, birthday, level, position, salary, dno) values('测试', '1990-03-03', 3, '教务', 3000.00, 9999);

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.IntegrityError) (1452, 'Cannot add or update a child row: a foreign key constraint fails (`stu2100013081`.`emp`, CONSTRAINT `emp_ibfk_1` FOREIGN KEY (`dno`) REFERENCES `dept` (`dno`))')
[SQL: insert into emp(ename, birthday, level, position, salary, dno) values('测试', '1990-03-03' , 3, '教务' , 3000.00, 9999);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

测试外键约束：尝试删除存在员工的部门

In [60]:
%sql delete from dept where dno=0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.IntegrityError) (1451, 'Cannot delete or update a parent row: a foreign key constraint fails (`stu2100013081`.`emp`, CONSTRAINT `emp_ibfk_1` FOREIGN KEY (`dno`) REFERENCES `dept` (`dno`))')
[SQL: delete from dept where dno=0001;]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

## 中级约束设计

要求：  
1. 测试延迟约束，往Emp和Dept中插入互相参照的两行。PG是支持延迟约束的，MySQL不支持延迟约束，可以通过设置约束是否有效来完成
2. 将salary划分为5个区间，每个区间对应一个level值，保证每个员工的工资值和他的level值是正确对应的，这属于行级约束
3. 编写函数，输入员工的员工号，输出一个包含员工各方面信息的编码字符串，也即第二章中提到的智能码。  

在实现时，规范的做法是构造一张编码对照表，而不是把编码对应信息直接放在代码里面

### 通过设置约束是否有效测试延迟约束：

我们首先关闭外键检查，然后向emp和dept表中插入互相引用的两行数据，然后再开启外键检查。这样，我们就可以在两个表之间创建互相引用的行，而不会因为违反外键约束而导致插入失败。

In [61]:
%%sql
-- 关闭外键检查
set foreign_key_checks = 0;

-- 向emp表插入数据
insert into emp(ename, birthday, level, position, salary, dno) VALUES('郭老师', '1963-12-24', 1, '教师', 5000.00, 0001);

-- 向dept表插入数据
insert into dept(dname, budget, manager) VALUES('物理学院', 1000000.00, 0001);

-- 开启外键检查
set foreign_key_checks = 1;

 * mysql://stu2100013081:***@162.105.146.37:43306

0 rows affected.
1 rows affected.
(pymysql.err.DataError) (1265, "Data truncated for column 'dname' at row 1")
[SQL: -- 向dept表插入数据
insert into dept(dname, budget, manager) VALUES('物理学院', 1000000.00, 0001);]
(Background on this error at: https://sqlalche.me/e/20/9h9h)

查询刚插入的数据：

In [62]:
%sql select * from emp where eno = 0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(1, '李老师', datetime.date(1970, 1, 1), 3, '教师', Decimal('5000.00'), 1)]

In [63]:
%sql select * from dept where dno = 0001;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(1, '数学学院', Decimal('1000000.00'), 1)]

### 行级约束

创建触发器在插入或更新数据时检查salary和level是否匹配

In [64]:
%%sql
create trigger check_salary_level_before_insert before insert on emp
for each row
begin
	if new.salary < 4000 then
		if new.level <> 1 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 8000 then
		if new.level <> 2 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 12000 then
		if new.level <> 3 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	elseif new.salary < 16000 then
		if new.level <> 4 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	else
		if new.level <> 5 then
			signal sqlstate '45000' set message_text = 'Salary and level do not match.';
		end if;
	end if;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

测试代码：

正确的插入，应该成功

In [65]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) 
values('陈老师', '1980-01-01', 3, '教务', 10000.00, 0001);
select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
4 rows affected.

[(1, '李老师', datetime.date(1970, 1, 1), 3, '教师', Decimal('5000.00'), 1),
 (2, '赵教务', datetime.date(1980, 2, 2), 4, '教务', Decimal('8000.00'), 2),
 (4, '郭老师', datetime.date(1963, 12, 24), 1, '教师', Decimal('5000.00'), 1),
 (5, '陈老师', datetime.date(1980, 1, 1), 3, '教务', Decimal('10000.00'), 1)]

错误的插入，应该失败并触发触发器中的错误信息

In [66]:
%%sql
insert into emp(ename, birthday, level, position, salary, dno) 
values('孙老师', '1985-01-01', 2, '会计', 10000.00, 0001);
select * from emp;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Salary and level do not match.')
[SQL: insert into emp(ename, birthday, level, position, salary, dno)
values('孙老师', '1985-01-01', 2, '会计', 10000.00, 0001);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

### 输出编码字符串

构造一张编码对照表

In [67]:
%%sql
drop table if exists code_table;
create table code_table (
    type enum('level', 'position'),
    name varchar(255),
    code char(2)
);

insert into code_table (type, name, code) VALUES 
    ('level', '1', '01'),
    ('level', '2', '02'),
    ('level', '3', '03'),
    ('level', '4', '04'),
    ('level', '5', '05'),
    ('position', '教师', '01'),
    ('position', '教务', '02'),
    ('position', '会计', '03'),
    ('position', '秘书', '04');

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
9 rows affected.

[]

In [68]:
%%sql
drop function if exists get_emp_info;
create function get_emp_info(eno int) returns char(20)
begin
    declare dno char(4);
    declare birthyear char(4);
    declare level_code char(2);
    declare position_code char(2);
    declare manager char(4);
    
    select 
        LPAD(e.dno, 4, '0'), 
        year(e.birthday), 
        (select code from code_table where type = 'level' and name = CAST(e.level as char)), 
        (select code from code_table where type = 'position' and name = e.position), 
        LPAD(d.manager, 4, '0')
    into 
        dno, birthyear, level_code, position_code, manager
    from
        emp e JOIN dept d ON e.dno = d.dno
    where
        e.eno = eno;
    
    return CONCAT(LPAD(eno, 4, '0'), dno, birthyear, level_code, position_code, manager);
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

测试代码：

In [69]:
%sql select get_emp_info(1);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[('00010001197003010001',)]

In [70]:
%sql select get_emp_info(2);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[('00020002198004020002',)]

In [71]:
%sql select get_emp_info(3);

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.

[(None,)]

## 高级约束设计

要求：  
1. 如果插入的数据违反约束定义，使用触发器修改数据，使其符合约束后再插入，可以使用before或者instead of触发器完成。对于中级约束的第2项任务，定义监视Emp表上插入和更新操作的触发器，按照salary的新值来设置其level值即可。
2. 使用函数约束或者触发器来保证管理者的工资必须高于他所管理的任何一个员工
3. 使用触发器保证任何一个员工工资的变化额度，都应该体现在他所在部门的预算上面，本质上这相当于实现了一个物化视图的一致性维护机制（触发器应该考虑到员工改变工作部门的情况，从一致性维护效率的角度，完全重算当然最简单，但希望还是实现基于更新行的增量更新）

### 根据salary的新值设置level值

In [72]:
%%sql
drop trigger if exists check_salary_level_before_insert;
create trigger emp_before_insert before insert on emp
for each row
begin
    case
        when new.salary < 4000 then set new.level = 1;
        when new.salary < 8000 then set new.level = 2;
        when new.salary < 12000 then set new.level = 3;
        when new.salary < 16000 then set new.level = 4;
        else set new.level = 5;
    end case;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.

[]

测试代码：

In [73]:
%%sql
insert into emp (ename, birthday, level, position, salary, dno) 
values ('樊老师', '2000-09-24', 3, '教师', 3000, 1); 

select * from emp where ename = '樊老师';

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[(6, '樊老师', datetime.date(2000, 9, 24), 1, '教师', Decimal('3000.00'), 1)]

### 保证管理者的工资必须高于他所管理的任何一个员工：

In [74]:
%%sql
create trigger emp_before_update_salary before update on emp
for each row
begin
    if exists (
        select 1 
        from emp e 
        where e.dno = new.dno and e.salary > new.salary
    ) then
        signal sqlstate '45000' set message_text = 'Manager salary must be higher than any employee he/she manages';
    END IF;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

测试代码：

此更新应该失败，因为管理者工资应该在部门内最高

In [75]:
%sql update emp set salary = 4000 where eno = 2;

 * mysql://stu2100013081:***@162.105.146.37:43306
(pymysql.err.OperationalError) (1644, 'Manager salary must be higher than any employee he/she manages')
[SQL: update emp set salary = 4000 where eno = 2;]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

此更新应该成功

In [76]:
%%sql 
update emp set salary = 40000 where eno = 2;
select * from emp where eno = 2;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
1 rows affected.

[(2, '赵教务', datetime.date(1980, 2, 2), 4, '教务', Decimal('40000.00'), 2)]

### 保证任何一个员工工资的变化额度，都应该体现在他所在部门的预算上面：

In [77]:
%%sql
create trigger emp_after_update_salary after update on emp
for each row
begin
    if old.dno = new.dno  then
        update dept set budget = budget + new.salary - old.salary where dno = new.dno;
    else
        update dept set budget = budget - old.salary where dno = old.dno;
        update dept set budget = budget + new.salary where dno = new.dno;
    end if;
end;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.

[]

测试代码：

更新前各部门预算：

In [78]:
%sql select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
2 rows affected.

[(1, '数学学院', Decimal('1000000.00'), 1), (2, '计算机学院', Decimal('2000000.00'), 2)]

In [79]:
%%sql
update emp set salary = 70000 where eno = 1; 
select * from dept;

 * mysql://stu2100013081:***@162.105.146.37:43306
1 rows affected.
2 rows affected.

[(1, '数学学院', Decimal('1065000.00'), 1), (2, '计算机学院', Decimal('2000000.00'), 2)]

### 这个约束设计用来维护关系模式上的函数依赖

先假定表𝑆𝑇𝐶(𝑠𝑛𝑜,𝑡𝑛𝑜,𝑐𝑛𝑜)"上成立函数依赖" 𝑡𝑛𝑜→𝑐𝑛𝑜"和"(𝑠𝑛𝑜,𝑐𝑛𝑜)→𝑡𝑛𝑜，"它是满足" 3𝑁𝐹的

1. 数据准备，设置𝑠𝑛𝑜,𝑡𝑛𝑜, 𝑐𝑛𝑜的取值范围分别是1~10000, 1~1000, 1~100, 产生随机行，插入到一个临时表𝑡𝑚𝑝𝑆𝑇𝐶 ，去重后保证数据有至少100000行
2. 将(𝑠𝑛𝑜,𝑐𝑛𝑜)"和" 𝑡𝑛𝑜声明为unique，然后把𝑡𝑚𝑝𝑆𝑇𝐶中数据导入到表𝑆𝑇𝐶中，查看用时及导入成功的行数，并统计(tno, cno)的冗余，这就是3NF为维护函数依赖所付出的代价
3. 𝐵𝐶𝑁𝐹设计则会把𝑆𝑇𝐶(𝑠𝑛𝑜,𝑡𝑛𝑜,𝑐𝑛𝑜)分解为𝑆𝐶(𝑠𝑛𝑜, 𝑐𝑛𝑜)和𝑇𝐶(𝑡𝑛𝑜,𝑐𝑛𝑜)  ，这时只需要维护𝑇𝐶上的𝑡𝑛𝑜→𝑐𝑛𝑜,将𝑡𝑛𝑜声明为unique，同样把𝑡𝑚𝑝𝑆𝑇𝐶中数据导入到表𝑇𝐶中，查看用时以及导入成功的行数
4. 使用触发器来实现𝑆𝑇𝐶上的这两个函数依赖，看看完成𝑡𝑚𝑝𝑆𝑇𝐶数据导入到𝑆𝑇𝐶的用时

先清理

In [183]:
%%sql 

drop table if exists tmpSTC;
drop table if exists STC;
drop table if exists SC;
drop table if exists TC;
drop table if exists STC_trigger;
DROP PROCEDURE IF EXISTS generate_random_data;

show tables;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
4 rows affected.

[('code_table',), ('dept',), ('emp',), ('tmptable',)]

1. 准备数据

In [184]:
%%sql

-- 创建临时表tmpSTC
CREATE TABLE tmpSTC (
    sno INT,
    tno INT,
    cno INT,
    PRIMARY KEY (sno, tno, cno)
);

-- 创建存储过程
CREATE PROCEDURE generate_random_data()
BEGIN
    DECLARE i INT DEFAULT 0;
    DECLARE inserted_rows INT DEFAULT 0;
    DECLARE target_rows INT DEFAULT 100000;
    DECLARE new_sno INT;
    DECLARE new_tno INT;
    DECLARE new_cno INT;
    
    WHILE inserted_rows < target_rows DO
        -- 生成随机行
        SET new_sno = FLOOR(1 + RAND() * 10000);
        SET new_tno = FLOOR(1 + RAND() * 1000);
        SET new_cno = FLOOR(1 + RAND() * 100);
        
        -- 检查该行是否已存在
        IF NOT EXISTS (SELECT 1 FROM tmpSTC WHERE sno = new_sno AND tno = new_tno AND cno = new_cno) THEN
            INSERT INTO tmpSTC (sno, tno, cno) VALUES (new_sno, new_tno, new_cno);
            SET inserted_rows = inserted_rows + 1;
        END IF;
        
        SET i = i + 1;
    END WHILE;
END;

-- 调用存储过程生成随机数据
CALL generate_random_data();

SELECT COUNT(*) FROM tmpSTC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.

[(100000,)]

2. 声明 Unique 约束并导入数据

In [185]:
%%sql

drop table if exists STC;
CREATE TABLE STC (
    sno INT,
    tno INT UNIQUE,
    cno INT,
    PRIMARY KEY (sno, cno)
);

INSERT IGNORE INTO STC (sno, tno, cno) SELECT * FROM tmpSTC;

SELECT COUNT(*) AS STC_CNT FROM STC;

SELECT COUNT(*) - COUNT(DISTINCT tno, cno) AS redundancy FROM STC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
1000 rows affected.
1 rows affected.
1 rows affected.

[(0,)]

3. BCNF 设计

对于 BCNF 的设计，我们将表分解为 SC 和 TC。

In [186]:
%%sql

-- 创建表SC和TC
drop table if exists SC;
CREATE TABLE SC (
    sno INT,
    cno INT,
    PRIMARY KEY (sno, cno)
);

drop table if exists TC;
CREATE TABLE TC (
    tno INT UNIQUE,
    cno INT,
    PRIMARY KEY (tno, cno)
);

INSERT IGNORE INTO SC (sno, cno)
SELECT DISTINCT sno, cno FROM tmpSTC;

INSERT IGNORE INTO TC (tno, cno)
SELECT DISTINCT tno, cno FROM tmpSTC;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
95492 rows affected.
1000 rows affected.

[]

4. 使用触发器维护函数依赖

In [189]:
%%sql

-- 当 tno 更新导致 cno 改变时的触发器
drop trigger if exists update_cno;
CREATE TRIGGER update_cno AFTER UPDATE ON STC
FOR EACH ROW
BEGIN
    IF NEW.tno <> OLD.tno THEN
        UPDATE STC SET cno = (SELECT cno FROM STC WHERE tno = NEW.tno LIMIT 1)
        WHERE sno = NEW.sno;
    END IF;
END;

-- 当 sno 或 cno 更新导致 tno 改变时的触发器
drop trigger if exists update_tno;
CREATE TRIGGER update_tno AFTER UPDATE ON STC
FOR EACH ROW
BEGIN
    IF NEW.sno <> OLD.sno OR NEW.cno <> OLD.cno THEN
        UPDATE STC SET tno = (SELECT tno FROM STC WHERE sno = NEW.sno AND cno = NEW.cno LIMIT 1)
        WHERE sno = NEW.sno AND cno = NEW.cno;
    END IF;
END;

-- 测量开始时间
SET @start_time = CURRENT_TIMESTAMP();

-- 插入数据到 STC
INSERT IGNORE INTO STC (sno, tno, cno)
SELECT * FROM tmpSTC;

-- 测量结束时间
SET @end_time = CURRENT_TIMESTAMP();

-- 计算时间差
SELECT TIMESTAMPDIFF(SECOND, @start_time, @end_time) AS duration_seconds;

 * mysql://stu2100013081:***@162.105.146.37:43306
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.

[(4,)]